In [ ]:
# Import numpy & pandas libraries

In [4]:
import pandas as pd
import numpy as np

In [ ]:
# read Salaries.csv file

In [5]:
sal = pd.read_csv('Salaries.csv',low_memory=False)

In [ ]:
# Find minimum value of BasePay column

-166.01

In [ ]:
# Find maximum value of BasePay column

319275.01

In [ ]:
# Find all the details of employee where sal is 319275.01

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72925,72926,Gregory P Suhr,Chief of Police,319275.01,0.0,20007.06,86533.21,339282.07,425815.28,2013,NaN,San Francisco,NaN

In [ ]:
# Find mean BasePay

66325.44884048768

In [ ]:
# Find the name of employee which has maximum TotalPayBenefits

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [ ]:
# Find all details of employee which has minimum TotalPayBenefits

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148044,148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,PT

In [ ]:
# Find the index of row which contains min TotalPaybenefits

148044

In [ ]:
# For each year find the mean BasePay

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [ ]:
# Find unique JobTitles

2154

In [ ]:
# Find the maximum 5 JobTitle with the number of employees

Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Name: JobTitle, dtype: int64

In [ ]:
# Find the no. of Job Title who contains only 1 employee in Year 2013

202

In [ ]:
# Find the no. of Job Title which contains 'chief' in its Job Title

476

In [ ]:
# Find the correlation between TotalPayBenefits & "length of Job Title" as "title_len"

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036669
title_len                -0.036669   1.000000